{
    "funfacts": [
        "You Can Run Java Code Without a main() Method!",
        "Java is not a coffee!!! -But coffee while coding is top notch!",
        "Before it was called Java, this language was called Oak because its founder saw an Oak tree outside his office",
        "The 'Write Once, Run Anywhere' (WORA) principle allows Java to run anywhere, including on smart refrigerators!",
        "Java has a cute mascot named Duke, who looks more like a triangular alien than a coffee cup!",
        "Java was born in 1995, if you're born after that, Java is older than you!",
        "Most of the Android application build in Java, if you're using Android phone, you're already use Java everyday!",
        "Minecraft, a world popular game build with Java",
        "Many Java developers admit that they often get confused because of NullPointerException—more upset than a ghosting ex!",
        "Java doesn't have pointers like C++, but still many programmers get their heads hanging while debugging!",
        "The Java compiler is like a killer lecturer—if you make the slightest mistake, it will immediately give you a red error without mercy!",
        "Want to make a Java program? Get ready to make friends with Exception. It's not your ex who blocked you, but it's still annoying!",
        "If this is your first time learning Java, 99% of the time you will write this first: System.out.println(\"Hello, World!\");",
        "You must have written Java code, but the program didn't work, and then realized you forgot to create a public static void main(String[] args)!",
        "\"To Java\" means drinking coffee. But if a programmer says \"I'm Java-ing\", it means he's coding (while drinking coffee)!",
        "Java was born in 1995, making it older than Google! Yep, it's been rocking the coding world for decades.",
        "Before it was called Java, it was named 'Oak'—like the tree! But they changed it because, well, boring.",
        "Java's motto is 'Write Once, Run Anywhere' (WORA). It’s basically the world traveler of programming languages!",
        "Java was created for smart toasters and TVs. Imagine if your toaster could code in Java today.",
        "JVM (Java Virtual Machine) is like Java’s personal butler—it makes sure Java runs smoothly on any system.",
        "Minecraft was built with Java. So yeah, Java isn’t just serious business—it also builds blocky worlds of fun! ",
        "Java has automatic garbage collection. It’s like having a Roomba that cleans up your code’s mess.",
        "Big shots like Google, Amazon, and Netflix use Java to keep the internet running. You’re basically coding with the pros!",
        "Java is THE language for Android apps. Your favorite mobile apps? Java might be behind them!",
        "The Java logo is a cup of coffee because the devs were fueled by caffeine. Code and coffee—best combo ever!",
        "Java supports multithreading, which means it can do multiple things at once—like a ninja octopus. ",
        "Spring Framework is one of Java’s most powerful tools. Think of it as Java’s superhero sidekick!",
        "Java doesn’t need pointers like C++. No more memory mishaps—it’s like having a seatbelt for your code!",
        "Java’s mascot, Duke, is a little triangle dude with arms. Not the hero we expected, but the one we got.",
        "Java’s syntax is super similar to C++. It’s like C++’s younger, cooler cousin who likes things simple.",
        "Oracle owns Java now, but it was originally created by Sun Microsystems. The more you know!",
        "Java’s security is top-notch. It’s like having a cybersecurity guard built into your code.",
        "Universities love Java! It’s like the first language they introduce to new coders—Java 101, anyone?",
        "Java can run on anything—from tiny chips to supercomputers. If it has electricity, Java can probably run on it!",
        "Java is a champion of open-source projects. Tons of frameworks and libraries = less work for you.",
        "IoT (Internet of Things) devices love Java. Your smart fridge might just be speaking Java right now!",
        "Java’s error messages are sometimes hilarious. 'NullPointerException'? Sounds like Java’s way of trolling you.",
        "The latest Java updates keep making it faster and cooler. It’s like a language that never gets old!",
        "Even after 25+ years, Java is still one of the most popular languages. Some things just never go out of style!"
    ]
}